{"storage":"Store below 30°C","overview":["Hifenac-P Tablet is a pain-relieving medicine. It is used to reduce pain and inflammation in conditions like rheumatoid arthritis, ankylosing spondylitis, and osteoarthritis. It may also be used to relieve muscle pain, back pain, toothache, or pain in the ear and throat.","Hifenac-P Tablet should be taken with or without food. You should take it regularly as advised by your doctor. Your doctor may change the dose and time between doses according to your pain level and your needs. Do not take more or use it for a longer duration than recommended by your doctor.","Some of the common side effects of this medicine include nausea, vomiting, stomach pain, loss of appetite, heartburn, and diarrhea. If any of these side effects bother you or do not go away with time, you should let your doctor know. Your doctor may help you with ways to reduce or prevent these side effects by prescribing an alternative medicine or adjusting the dose.","The medicine may not be suitable for everybody. Before taking it, let your doctor know if you have any problems with your heart, kidneys, liver, or have stomach ulcers. To make sure it is safe for you, let your doctor know about all the other medicines you are taking. Pregnant and breastfeeding mothers should first consult their doctors before using this medicine."],"missed_dose":["If you miss a dose of Hifenac-P Tablet, take it as soon as possible. However, if it is almost time for your next dose, skip the missed dose and go back to your regular schedule. Do not double the dose."],"uses_and_benefits":["USES OF HIFENAC-P TABLET","Pain relief","BENEFITS OF HIFENAC-P TABLET","In Pain relief","Hifenac-P Tablet is used for short-term relief of pain, inflammation, and swelling in conditions that affect joints and muscles. Some of the conditions in which Hifenac-P Tablet is used are rheumatoid arthritis, osteoarthritis, muscle pain, back pain, toothache, or pain in the ear and throat. Take it as it is prescribed to get the most benefit. Do not take more or longer than needed as that can be dangerous. In general, you should take the lowest dose that works, for the shortest possible time. This will help you to go about your daily activities more easily and have a better, more active, quality of life."],"side_effects":["SIDE EFFECTS OF HIFENAC-P TABLET","Most side effects do not require any medical attention and disappear as your body adjusts to the medicine. Consult your doctor if they persist or if you’re worried about them","Common side effects of Hifenac-P","Nausea","Vomiting","Stomach pain/epigastric pain","Loss of appetite","Heartburn","Diarrhea"],"how_to_use":["HOW TO USE HIFENAC-P TABLET","Take this medicine in the dose and duration as advised by your doctor. Swallow it as a whole. Do not chew, crush or break it. Hifenac-P Tablet may be taken with or without food, but it is better to take it at a fixed time."],"how_drug_works":["HOW HIFENAC-P TABLET WORKS","Hifenac-P Tablet is a combination of two medicines: Aceclofenac and Paracetamol. These medicines work by blocking the action of chemical messengers responsible for pain, fever and inflammation (redness and swelling)."],"safety_advice":["SAFETY ADVICE","Alcohol","UNSAFE","It is unsafe to consume alcohol with Hifenac-P Tablet.","Pregnancy","CONSULT YOUR DOCTOR","Hifenac-P Tablet may be unsafe to use during pregnancy. Although there are limited studies in humans, animal studies have shown harmful effects on the developing baby. Your doctor will weigh the benefits and any potential risks before prescribing it to you. Please consult your doctor.","Breast feeding","CONSULT YOUR DOCTOR","Information regarding the use of Hifenac-P Tablet during breastfeeding is not available. Please consult your doctor.","Driving","UNSAFE","Hifenac-P Tablet may decrease alertness, affect your vision or make you feel sleepy and dizzy. Do not drive if these symptoms occur.","Kidney","CAUTION","Hifenac-P Tablet should be used with caution in patients with kidney disease. Dose adjustment of Hifenac-P Tablet may be needed. Please consult your doctor.","Use of Hifenac-P Tablet is not recommended in patients with severe kidney disease.","Liver","CAUTION","Hifenac-P Tablet should be used with caution in patients with liver disease. Dose adjustment of Hifenac-P Tablet may be needed. Please consult your doctor.","However, the use of Hifenac-P Tablet is not recommended in patients with severe liver disease and active liver disease."],"substitutes":["All substitutes","For informational purposes only. Consult a doctor before taking any medicines.","Hifenac-P Tablet","₹6.03/Tablet","Fenceta Novo 100mg/325mg Tablet","Alkem Laboratories Ltd","₹2.8/tablet","54% cheaper","Arflur-P Tablet","FDC Ltd","₹4.15/tablet","31% cheaper","XREL Tablet","Deys Medical","₹4.4/tablet","27% cheaper","Bignac P Tablet","Ronyd Healthcare Pvt Ltd","₹4.5/tablet","25% cheaper","Anaflam XP 100mg/325mg Tablet","Albert David Ltd","₹4.8/tablet","20% cheaper","VIEW ALL SUBSTITUTES"],"expert_advice":["Quick tips","You have been prescribed this combination medicine for relieving pain and inflammation.","Take it with food to avoid getting an upset stomach.","It may cause dizziness and sleepiness. Do not drive or do anything that requires mental focus until you know how it affects you.","Avoid consuming alcohol when taking Hifenac-P Tablet as it may cause excessive drowsiness and increase the risk of liver damage.","Do not take it with any other medicine containing acetaminophen (drugs for pain/fever or cough-and-cold) without asking your doctor first. "],"fact_box":["Fact Box","Habit Forming","No","Therapeutic Class","PAIN ANALGESICS"],"drug_interaction":[""],"updateDate":["Last updated:","04 Feb 2022 | 07:02 PM (IST)"]}