{"storage":"Store below 30°C","overview":[{"heading":"INTRODUCTION","list":["Zempred 4 Tablet is a medicine used to treat a wide variety of medical conditions such as severe allergic conditions, asthma, rheumatic disorder, skin and eye disorders, and systemic lupus erythematosus. It provides relief by preventing the release of substances that cause inflammation.","Zempred 4 Tablet should be taken with food. This will prevent you from getting an upset stomach. The dose and duration will depend on what you are being treated for. You should always take the amount prescribed. Do not take a larger dose or use it more often. Keep taking it regularly even if you feel well. Some conditions will become worse if you stop using this medicine.","The most common side effects of this medicine include skin thinning, increased risk of infection, reduction in bone density, weight gain, and mood changes. If these side effects bother you or do not go away, your doctor may suggest ways of preventing or reducing them. The use of this medicine may lower your ability to fight infections so avoid being near people who might pass on infections such as measles, chickenpox, or flu.","Before using this medicine, you should tell your doctor if you have brittle bones (osteoporosis), mood disorders, high blood pressure, or liver disease. Also, tell your doctor if you have diabetes, this medicine may increase blood glucose levels which can cause or worsen diabetes. Many other drugs may affect, or be affected by, this medicine so let your doctor know all other medicines you are using, to make sure it is safe. You should also tell your doctor if you are pregnant, planning pregnancy or breastfeeding."]}],"Substitute":[{"name":"Prelid 4mg Tablet","link":"prelid-4mg-tablet-297348"},{"name":"Coelone 4mg Tablet","link":"coelone-4mg-tablet-332768"},{"name":"Predace 4 Tablet","link":"predace-4-tablet-13026"},{"name":"Pilsone 4mg Tablet","link":"pilsone-4mg-tablet-300300"},{"name":"Mepresso T 4mg Tablet","link":"mepresso-t-4mg-tablet-295900"}],"missed_dose":["If you miss a dose of Zempred 4 Tablet, take it as soon as possible. However, if it is almost time for your next dose, skip the missed dose and go back to your regular schedule. Do not double the dose."],"updateDate":["04 Feb 2022 | 07:02 PM (IST)"],"expert_advice":[{"list":["Zempred 4 Tablet helps treat inflammation, severe allergies, flare-ups of ongoing illnesses, and many other medical problems that require either reduction of inflammation or suppression of the immune system.","Do not use it more often or for longer than advised by your doctor.","Take it with food to avoid an upset stomach.","Zempred 4 Tablet can make it harder for you to fight off infections. Notify your doctor if you have any signs of infection such as a fever or sore throat.","Side effects such as mood changes or stomach problems can happen when you start taking Zempred 4 Tablet. Inform your doctor if this bothers you.","Do not stop taking Zempred 4 Tablet suddenly without talking to your doctor first as it may worsen your symptoms."]}],"how_to_use":["Take this medicine in the dose and duration as advised by your doctor. Swallow it as a whole. Do not chew, crush or break it. Zempred 4 Tablet is to be taken with food.","Avoid Zempred 4 Tablet with dietary sodium."],"fact_box":[{"type":"Chemical Class","discription":"Glucocorticoids"},{"type":"Habit Forming","discription":"No"},{"type":"Therapeutic Class","discription":"HORMONES"},{"type":"Action Class","discription":"Glucocorticoids"}],"safety":[{"heading":"Alcohol","discription":"It is unsafe to consume alcohol with Zempred 4 Tablet."},{"heading":"Pregnancy","discription":"Zempred 4 Tablet may be unsafe to use during pregnancy. Although there are limited studies in humans, animal studies have shown harmful effects on the developing baby. Your doctor will weigh the benefits and any potential risks before prescribing it to you. Please consult your doctor."},{"heading":"Breast feeding","discription":"Zempred 4 Tablet is safe to use during breastfeeding. Human studies suggest that the drug does not pass into the breastmilk in a significant amount and is not harmful to the baby."},{"heading":"Driving","discription":"Zempred 4 Tablet may cause side effects which could affect your ability to drive.\nUndesirable effects, such as dizziness, vertigo, visual disturbances and fatigue are possible after treatment with Zempred 4 Tablet. This may affect your driving ability."},{"heading":"Kidney","discription":"Zempred 4 Tablet is safe to use in patients with kidney disease. No dose adjustment of Zempred 4 Tablet is recommended.\nHowever, talk to your doctor if you have any underlying kidney disease."},{"heading":"Liver","discription":"There is limited information available on the use of Zempred 4 Tablet in patients with liver disease. Please consult your doctor."}],"how_drug_works":[{"heading":"HOW ZEMPRED TABLET WORKS","discription":"Zempred 4 Tablet is a steroid which works by blocking the production of certain chemical messengers in the body that cause inflammation (redness and swelling) and allergies."}],"side_effects":[{"heading":"SIDE EFFECTS OF ZEMPRED TABLET","discription":["Most side effects do not require any medical attention and disappear as your body adjusts to the medicine. Consult your doctor if they persist or if you’re worried about them","Common side effects of Zempred","Thinning of skin","Increased risk of infection","Reduction in bone density","Weight gain","Mood changes","Upset stomach","Behavioural changes"]}],"drug_interaction":[{"drug":"Acarbose"},{"drug":"Aspirin"},{"drug":"Amlodipine"},{"drug":"Amphotericin B"}],"uses":[{"heading":"USES OF ZEMPRED TABLET","list":["Treatment of Rheumatic disorder","Treatment of Asthma","Treatment of Systemic lupus erythematosus (SLE)","Treatment of Allergic conditions","Treatment of Eye disorders","Treatment of Skin disorders"]}],"benefits":[{"heading":"BENEFITS OF ZEMPRED TABLET","list":["In Treatment of Rheumatic disorder","Rheumatic disorder is an autoimmune condition where your body’s immune system (which usually fights bacteria and viruses) attacks your body’s own cells. Zempred 4 Tablet stops that from happening and can relieve the symptoms of this condition such as pain, swelling, and stiffness in your joints. It can also slow down joint damage, reduce disability, and enable you to be as active for as long as possible. It can take several weeks or months to notice the effect of the medicine. You should continue taking it until your doctor says it is okay to stop using the medicine.","In Treatment of Asthma","Rheumatic disorder is an autoimmune condition where your body’s immune system (which usually fights bacteria and viruses) attacks your body’s own cells. Zempred 4 Tablet stops that from happening and can relieve the symptoms of this condition such as pain, swelling, and stiffness in your joints. It can also slow down joint damage, reduce disability, and enable you to be as active for as long as possible. It can take several weeks or months to notice the effect of the medicine. You should continue taking it until your doctor says it is okay to stop using the medicine.","In Treatment of Systemic lupus erythematosus (SLE)","Systemic lupus erythematosus (SLE) is an autoimmune disease. In this disease, the immune system of the body mistakenly attacks healthy tissue. It can affect the skin, joints, kidneys, brain, and other organs. Zempred 4 Tablet prevents the release of substances in the body that cause inflammation. It lowers your immune system’s response and reduces symptoms such as swelling, pain, itching and other allergic-type reactions.","In Treatment of Allergic conditions","Zempred 4 Tablet is used to treat different inflammatory and allergic conditions including arthritis, lupus, psoriasis, ulcerative colitis which affect the skin, blood, eyes, lungs, stomach, and nervous system. It works by lowering your immune system’s response to these conditions thereby reducing symptoms such as swelling, pain, itching and other allergic-type reactions.","This medicine is given orally (by mouth). You should always take it as it has been prescribed for you. Do not stop taking it without your doctor’s advice. This can cause unpleasant withdrawal symptoms. Because this medicine weakens your immune system, you should avoid being near people who are ill or have infections.","In Treatment of Eye disorders","Zempred 4 Tablet helps relieve symptoms of eye infections such as redness, swelling, itching and watering of eyes. This medicine works by decreasing the production of certain chemicals that cause inflammation of the eyes. This will make it easier for you to go about your daily activities. Use it as prescribed to get the most benefit. If you see no improvement even after a week, talk to your doctor.","In Treatment of Skin disorders","Zempred 4 Tablet prevents the release of substances in the body that cause inflammation. It can be used to treat different inflammatory and allergic conditions of the skin such as eczema and psoriasis. It works by lowering your immune system’s response to these conditions thereby relieving symptoms such as swelling, pain, itching and other allergic-type reactions."]}]}