{"storage":"Store below 30°C","overview":[{"heading":"INTRODUCTION","list":["Lecope Tablet belongs to a group of medicines called antihistamines. It is used to treat various allergic conditions such as hay fever, conjunctivitis, some skin reactions such as eczema, hives, and reactions to bites and stings. It also relieves watery eyes, runny nose, sneezing, and itching.","Lecope Tablet can be taken with or without food. The dose required by you may vary depending on what you are taking it for. This medicine is usually taken in the evening, but follow the advice of your doctor on how to take it. You may need this medicine only on days you have symptoms, but if you are taking it to prevent the symptoms then you should take it regularly. If you miss doses or stop taking it earlier than advised, your symptoms may come back.","This medicine is generally very safe. The most common side effects include feeling sleepy or dizzy, dry mouth, fatigue, and headache. These are usually mild and go away after a couple of days as your body adjusts to it. Consult your doctor if any of the side effects persist or worry you.","Before taking it, tell your doctor if you have any kidney problems or epilepsy (seizures). Your dose may need to be modified or this medicine may not suit you. Some other medicines can interact with this medicine so let your healthcare team know what else you are taking. You should also talk to your doctor before using this medicine if you are pregnant or breastfeeding, although it is not thought to be harmful."]}],"Substitute":[{"name":"LCZ Tablet","link":"lcz-tablet-15126"},{"name":"1-AL Tablet","link":"1-al-tablet-62991"},{"name":"Hatric Tablet","link":"hatric-tablet-15204"},{"name":"Levocet Tablet","link":"levocet-tablet-69789"},{"name":"Safecet Tablet","link":"safecet-tablet-15485"}],"missed_dose":["If you miss a dose of Lecope Tablet, take it as soon as possible. However, if it is almost time for your next dose, skip the missed dose and go back to your regular schedule. Do not double the dose."],"updateDate":["04 Feb 2022 | 07:02 PM (IST)"],"expert_advice":[{"list":["Your doctor has prescribed Lecope Tablet to help relieve allergy symptoms such as itching, swelling, and rashes.","As compared to other similar medications, it is much less likely to make you feel sleepy.","Be cautious while driving or doing anything that requires concentration as it can cause dizziness and sleepiness.","Do not drink alcohol while taking this medication as it may cause increased sleepiness.","Stop taking Lecope Tablet at least three days before taking an allergy test as it can affect the test results."]}],"how_to_use":["Take this medicine in the dose and duration as advised by your doctor. Swallow it as a whole. Do not chew, crush or break it. Lecope Tablet may be taken with or without food, but it is better to take it at a fixed time."],"fact_box":[{"type":"Chemical Class","discription":"Piperazine Derivatives"},{"type":"Habit Forming","discription":"No"},{"type":"Therapeutic Class","discription":"RESPIRATORY"},{"type":"Action Class","discription":"H1 Antihistaminics (second Generation)"}],"safety":[{"heading":"Alcohol","discription":"Lecope Tablet may cause excessive drowsiness with alcohol."},{"heading":"Pregnancy","discription":"Lecope Tablet is generally considered safe to use during pregnancy. Animal studies have shown low or no adverse effects to the developing baby; however, there are limited human studies."},{"heading":"Breast feeding","discription":"Lecope Tablet is probably safe to use during breastfeeding. Limited human data suggests that the drug does not represent any significant risk to the baby.\nLarger doses or more prolonged use of Lecope Tablet may cause drowsiness and other effects in the baby or decrease the milk supply"},{"heading":"Driving","discription":"Lecope Tablet may decrease alertness, affect your vision or make you feel sleepy and dizzy. Do not drive if these symptoms occur."},{"heading":"Kidney","discription":"Lecope Tablet should be used with caution in patients with kidney disease. Dose adjustment of Lecope Tablet may be needed. Please consult your doctor.\nUse of Lecope Tablet is not recommended in patients with severe kidney disease."},{"heading":"Liver","discription":"Lecope Tablet is safe to use in patients with liver disease. No dose adjustment of Lecope Tablet is recommended."}],"how_drug_works":[{"heading":"HOW LECOPE TABLET WORKS","discription":"Lecope Tablet is an antihistaminic medication. It treats allergy symptoms such as itching, swelling, and rashes by blocking the effects of a chemical messenger (histamine) in the body."}],"side_effects":[{"heading":"SIDE EFFECTS OF LECOPE TABLET","discription":["Most side effects do not require any medical attention and disappear as your body adjusts to the medicine. Consult your doctor if they persist or if you’re worried about them","Common side effects of Lecope","Sleepiness","Fatigue","Headache","Dryness in mouth"]}],"drug_interaction":[{"drug":"Aprepitant","lvl":"LIFE-THREATENING"},{"drug":"Fosaprepitant","lvl":"LIFE-THREATENING"},{"drug":"Zafirlukast"},{"drug":"Alprazolam"}],"uses":[{"heading":"USES OF LECOPE TABLET","list":["Treatment of Allergic conditions"]}],"benefits":[{"heading":"BENEFITS OF LECOPE TABLET","list":["In Treatment of Allergic conditions","Lecope Tablet provides relief from symptoms such as blocked or runny nose, sneezing, and itchy or watery eyes. This will make it easier for you to go about your daily activities. It can also give relief from allergic reactions after insect bites and symptoms of hives and eczema such as rash, swelling, itching, and irritation. This will improve the appearance of your skin and you may find that your mood and self-confidence improve as well. It rarely has any serious side effects and you may only need to take it on days you have symptoms. Moreover, Lecope Tablet may make you feel less sleepy as compared to other antihistamine medicines. If you are taking it to prevent getting symptoms you should use it regularly to get the most benefit."]}]}